//操作ボタン表示
function Button(){
    //左ボタン
    fCir(130, 1060, 100, "orange");
    line(90, 1060, 150, 1010, "white");
    line(90, 1060, 150, 1110, "white");
    line(90, 1060, 180, 1060, "white");
    //下ボタン
    fCir(360, 1060, 100, "orange");
    line(360, 1110, 310, 1050, "white");
    line(360, 1110, 410, 1050, "white");
    line(360, 1110, 360, 1010, "white");
    //右ボタン
    fCir(600, 1060, 100, "orange");
    line(650, 1060, 590, 1010, "white");
    line(650, 1060, 590, 1110, "white");
    line(650, 1060, 560, 1060, "white");
    //回転ボタン
    fCir(840, 1060, 100, "orange");
    line(890, 1050, 890, 1010, "white");
    line(890, 1010, 790, 1010, "white");
    line(790, 1010, 790, 1050, "white");
    line(790, 1050, 770, 1040, "white");
    line(790, 1050, 810, 1040, "white");
    line(790, 1070, 790, 1100, "white");
    line(790, 1100, 890, 1100, "white");
    line(890, 1100, 890, 1070, "white");
    line(890, 1070, 870, 1080, "white");
    line(890, 1070, 910, 1080, "white");
}
